

group_ids = {
    1: ("凝灰岩", 0),
    2: ("凝灰岩", 0),
    3: ("凝灰岩", 0),
    4: ("凝灰岩", 0),
    5: ("凝灰岩", 0),
    6: ("粉砂岩", 1),
    7: ("砂岩", 2),
    8: ("砂岩", 2),
    9: ("砂岩", 2),
    10: ("砂岩", 2),
    11: ("砂岩", 2),
    12: ("砂岩", 2),
    28: ("砂岩", 2),
    13: ("泥页岩", 3),
    14: ("泥页岩", 3),
    15: ("泥页岩", 3),
    16: ("泥页岩", 3),
    17: ("灰岩", 4),
    18: ("灰岩", 4),
    19: ("灰岩", 4),
    20: ("灰岩", 4),
    21: ("灰岩", 4),
    22: ("白云岩", 5),
    23: ("硅质岩", 6),
    24: ("磷块岩", 7),
    25: ("硬石膏", 8),
    26: ("赤铁矿岩", 9),
    27: ("铝土矿", 10),
}


def sedimentary_type(group_id) -> (str, int) :
    if group_id in group_ids:
        return group_ids[group_id]
    return "未知", -1


name_ids = {
    "沉": 0,
    "火": 1,
    "变": 2,
}


def stone_type(type_name) -> int :
    if type_name in name_ids:
        return name_ids[type_name]
    return "未知", -1

